; domain
(define (domain grid_world ) 
(:requirements :strips :typing) 
(:types car
agent - car
gridcell
) 
(:predicates (at ?pt1 - gridcell ?agent - agent) 
(up_next ?pt1 - gridcell ?pt2 - gridcell) 
(down_next ?pt1 - gridcell ?pt2 - gridcell) 
(forward_next ?pt1 - gridcell ?pt2 - gridcell) 
(blocked ?pt1 - gridcell) 
) 
(:action UP
:parameters ( ?pt1 - gridcell ?pt2 - gridcell ?agent - agent) 
:precondition (and (at ?pt1 ?agent) (up_next ?pt1 ?pt2) (not(blocked ?pt2)))
:effect (and (at ?pt2 ?agent) (not (at ?pt1 ?agent)))
) 
(:action DOWN
:parameters ( ?pt1 - gridcell ?pt2 - gridcell ?agent - agent) 
:precondition (and (at ?pt1 ?agent) (down_next ?pt1 ?pt2) (not(blocked ?pt2)))
:effect (and (at ?pt2 ?agent) (not (at ?pt1 ?agent)))
) 
(:action FORWARD
:parameters ( ?pt1 - gridcell ?pt2 - gridcell ?agent - agent) 
:precondition (and (at ?pt1 ?agent) (forward_next ?pt1 ?pt2) (not(blocked ?pt2)))
:effect (and (at ?pt2 ?agent) (not (at ?pt1 ?agent)))
) 
)

; problem
(define (problem parking) 
 (:domain grid_world) 
(:objects agent1  - agent
 pt0pt0 pt0pt1 pt0pt2 pt0pt3 pt1pt0 pt1pt1 pt1pt2 pt1pt3 pt2pt0 pt2pt1 pt2pt2 pt2pt3 pt3pt0 pt3pt1 pt3pt2 pt3pt3 pt4pt0 pt4pt1 pt4pt2 pt4pt3 pt5pt0 pt5pt1 pt5pt2 pt5pt3 pt6pt0 pt6pt1 pt6pt2 pt6pt3 pt7pt0 pt7pt1 pt7pt2 pt7pt3 pt8pt0 pt8pt1 pt8pt2 pt8pt3 pt9pt0 pt9pt1 pt9pt2 pt9pt3  - gridcell
 ) 
(:init (at pt9pt3 agent1)(blocked pt7pt0)(blocked pt1pt2)(blocked pt2pt1)(blocked pt6pt0)(blocked pt4pt2)(blocked pt1pt1)(blocked pt1pt3)(blocked pt2pt3)(blocked pt9pt0)(blocked pt7pt2)(blocked pt5pt1)(blocked pt5pt3)(forward_next pt1pt0 pt0pt0)(up_next pt1pt0 pt0pt0)(down_next pt1pt0 pt0pt1)(forward_next pt1pt1 pt0pt1)(up_next pt1pt1 pt0pt0)(down_next pt1pt1 pt0pt2)(forward_next pt1pt2 pt0pt2)(up_next pt1pt2 pt0pt1)(down_next pt1pt2 pt0pt3)(forward_next pt1pt3 pt0pt3)(up_next pt1pt3 pt0pt2)(down_next pt1pt3 pt0pt3)(forward_next pt2pt0 pt1pt0)(up_next pt2pt0 pt1pt0)(down_next pt2pt0 pt1pt1)(forward_next pt2pt1 pt1pt1)(up_next pt2pt1 pt1pt0)(down_next pt2pt1 pt1pt2)(forward_next pt2pt2 pt1pt2)(up_next pt2pt2 pt1pt1)(down_next pt2pt2 pt1pt3)(forward_next pt2pt3 pt1pt3)(up_next pt2pt3 pt1pt2)(down_next pt2pt3 pt1pt3)(forward_next pt3pt0 pt2pt0)(up_next pt3pt0 pt2pt0)(down_next pt3pt0 pt2pt1)(forward_next pt3pt1 pt2pt1)(up_next pt3pt1 pt2pt0)(down_next pt3pt1 pt2pt2)(forward_next pt3pt2 pt2pt2)(up_next pt3pt2 pt2pt1)(down_next pt3pt2 pt2pt3)(forward_next pt3pt3 pt2pt3)(up_next pt3pt3 pt2pt2)(down_next pt3pt3 pt2pt3)(forward_next pt4pt0 pt3pt0)(up_next pt4pt0 pt3pt0)(down_next pt4pt0 pt3pt1)(forward_next pt4pt1 pt3pt1)(up_next pt4pt1 pt3pt0)(down_next pt4pt1 pt3pt2)(forward_next pt4pt2 pt3pt2)(up_next pt4pt2 pt3pt1)(down_next pt4pt2 pt3pt3)(forward_next pt4pt3 pt3pt3)(up_next pt4pt3 pt3pt2)(down_next pt4pt3 pt3pt3)(forward_next pt5pt0 pt4pt0)(up_next pt5pt0 pt4pt0)(down_next pt5pt0 pt4pt1)(forward_next pt5pt1 pt4pt1)(up_next pt5pt1 pt4pt0)(down_next pt5pt1 pt4pt2)(forward_next pt5pt2 pt4pt2)(up_next pt5pt2 pt4pt1)(down_next pt5pt2 pt4pt3)(forward_next pt5pt3 pt4pt3)(up_next pt5pt3 pt4pt2)(down_next pt5pt3 pt4pt3)(forward_next pt6pt0 pt5pt0)(up_next pt6pt0 pt5pt0)(down_next pt6pt0 pt5pt1)(forward_next pt6pt1 pt5pt1)(up_next pt6pt1 pt5pt0)(down_next pt6pt1 pt5pt2)(forward_next pt6pt2 pt5pt2)(up_next pt6pt2 pt5pt1)(down_next pt6pt2 pt5pt3)(forward_next pt6pt3 pt5pt3)(up_next pt6pt3 pt5pt2)(down_next pt6pt3 pt5pt3)(forward_next pt7pt0 pt6pt0)(up_next pt7pt0 pt6pt0)(down_next pt7pt0 pt6pt1)(forward_next pt7pt1 pt6pt1)(up_next pt7pt1 pt6pt0)(down_next pt7pt1 pt6pt2)(forward_next pt7pt2 pt6pt2)(up_next pt7pt2 pt6pt1)(down_next pt7pt2 pt6pt3)(forward_next pt7pt3 pt6pt3)(up_next pt7pt3 pt6pt2)(down_next pt7pt3 pt6pt3)(forward_next pt8pt0 pt7pt0)(up_next pt8pt0 pt7pt0)(down_next pt8pt0 pt7pt1)(forward_next pt8pt1 pt7pt1)(up_next pt8pt1 pt7pt0)(down_next pt8pt1 pt7pt2)(forward_next pt8pt2 pt7pt2)(up_next pt8pt2 pt7pt1)(down_next pt8pt2 pt7pt3)(forward_next pt8pt3 pt7pt3)(up_next pt8pt3 pt7pt2)(down_next pt8pt3 pt7pt3)(forward_next pt9pt0 pt8pt0)(up_next pt9pt0 pt8pt0)(down_next pt9pt0 pt8pt1)(forward_next pt9pt1 pt8pt1)(up_next pt9pt1 pt8pt0)(down_next pt9pt1 pt8pt2)(forward_next pt9pt2 pt8pt2)(up_next pt9pt2 pt8pt1)(down_next pt9pt2 pt8pt3)(forward_next pt9pt3 pt8pt3)(up_next pt9pt3 pt8pt2)(down_next pt9pt3 pt8pt3)) 
(:goal (at pt0pt0 agent1)) 
)

; plan
1. (down pt9pt3 pt8pt3 agent1)
   deleted: (at pt9pt3 agent1)
   added: (at pt8pt3 agent1)
   goals met: 0 of 1
2. (down pt8pt3 pt7pt3 agent1)
   deleted: (at pt8pt3 agent1)
   added: (at pt7pt3 agent1)
   goals met: 0 of 1
3. (up pt7pt3 pt6pt2 agent1)
   deleted: (at pt7pt3 agent1)
   added: (at pt6pt2 agent1)
   goals met: 0 of 1
4. (forward pt6pt2 pt5pt2 agent1)
   deleted: (at pt6pt2 agent1)
   added: (at pt5pt2 agent1)
   goals met: 0 of 1
5. (up pt5pt2 pt4pt1 agent1)
   deleted: (at pt5pt2 agent1)
   added: (at pt4pt1 agent1)
   goals met: 0 of 1
6. (up pt4pt1 pt3pt0 agent1)
   deleted: (at pt4pt1 agent1)
   added: (at pt3pt0 agent1)
   goals met: 0 of 1
7. (forward pt3pt0 pt2pt0 agent1)
   deleted: (at pt3pt0 agent1)
   added: (at pt2pt0 agent1)
   goals met: 0 of 1
8. (forward pt2pt0 pt1pt0 agent1)
   deleted: (at pt2pt0 agent1)
   added: (at pt1pt0 agent1)
   goals met: 0 of 1
9. (forward pt1pt0 pt0pt0 agent1)
   deleted: (at pt1pt0 agent1)
   added: (at pt0pt0 agent1)
   goals met: 1 of 1
